# GetLBSortColumn

## Description
Gets the index of the sort column in the specified list browser control.

```pascal
FUNCTION GetLBSortColumn(
				dialogID    : LONGINT;
				componentID : LONGINT) : INTEGER;
```

```python

def vs.GetLBSortColumn(dialogID, componentID):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|

## Version
Availability: from VectorWorks12.0
## Category
* Dialogs - Modern - Browser